import { Injectable } from '@nestjs/common';
import { CreateChatDto } from './dto/create-chat.dto';
import { UpdateChatDto } from './dto/update-chat.dto';

@Injectable()
export class ChatService {
  create(createChatDto: CreateChatDto) {
    return {
      meds: [
        {
          title: "Qorun o'griq",
          category: "Og'riq qoldiruvchi",
          description: `Sizning qandli diabetingiz bor ekan, shu sababli sizga loktovin dorisini icholmaysiz. Sizga tavsiya etiladi MeraTafsin preparati, kuniga ikki mahal ovqatdan keyin istemol qilishingiz zarur.`,
        },
      ],
    };
  }

  findAll() {
    return {
      meds: [
        {
          title: 'Trimol',
          category: "Og'riq qoldiruvchi",
          code: 5440005,
          description: `Парацетамол меъда-ичак йўлларидан тез ва деярли тўлиқ сўрилади. Плазмадаги чўққи концентрациясига 30-60 минутда эришади ва плазмадан ярим чиқарилиш даври терапевтик дозадан кейин 1-4 соатни ташкил қилади. Парацетамол аъзолар ва суюқликларида нисбатан тенг тақсимланади. Дори воситанинг плазма протеинлари билан боғланиши ўзгарувчан: ўткир интоксикация вақтида учрайдиган концентрацияларда 20-50% боғланиши мумкин. Терапевтик дозага қараб 90-100% дори восита биринчи кун давомида сийдик билан чиқарилиши мумкин. Шунга қарамасдан парацетамол деярли ўзгармасдан чиқарилмайди, асосий қисми жигардаги конъюгациясидан кейин чиқарилади.

          Ko'proq o'qish https://medu.uz/instruksiya/trimol-forte/`,
        },
      ],
    };
  }

  findOne(id: number) {
    return {
      meds: [
        {
          title: 'Trimol',
          category: "Og'riq qoldiruvchi",
          code: 5440005,
          description: `Парацетамол меъда-ичак йўлларидан тез ва деярли тўлиқ сўрилади. Плазмадаги чўққи концентрациясига 30-60 минутда эришади ва плазмадан ярим чиқарилиш даври терапевтик дозадан кейин 1-4 соатни ташкил қилади. Парацетамол аъзолар ва суюқликларида нисбатан тенг тақсимланади. Дори воситанинг плазма протеинлари билан боғланиши ўзгарувчан: ўткир интоксикация вақтида учрайдиган концентрацияларда 20-50% боғланиши мумкин. Терапевтик дозага қараб 90-100% дори восита биринчи кун давомида сийдик билан чиқарилиши мумкин. Шунга қарамасдан парацетамол деярли ўзгармасдан чиқарилмайди, асосий қисми жигардаги конъюгациясидан кейин чиқарилади.

          Ko'proq o'qish https://medu.uz/instruksiya/trimol-forte/`,
        },
      ],
    };
  }

  update(id: number, updateChatDto: UpdateChatDto) {
    return {
      meds: [
        {
          title: 'Trimol',
          category: "Og'riq qoldiruvchi",
          code: 5440005,
          description: `Парацетамол меъда-ичак йўлларидан тез ва деярли тўлиқ сўрилади. Плазмадаги чўққи концентрациясига 30-60 минутда эришади ва плазмадан ярим чиқарилиш даври терапевтик дозадан кейин 1-4 соатни ташкил қилади. Парацетамол аъзолар ва суюқликларида нисбатан тенг тақсимланади. Дори воситанинг плазма протеинлари билан боғланиши ўзгарувчан: ўткир интоксикация вақтида учрайдиган концентрацияларда 20-50% боғланиши мумкин. Терапевтик дозага қараб 90-100% дори восита биринчи кун давомида сийдик билан чиқарилиши мумкин. Шунга қарамасдан парацетамол деярли ўзгармасдан чиқарилмайди, асосий қисми жигардаги конъюгациясидан кейин чиқарилади.

          Ko'proq o'qish https://medu.uz/instruksiya/trimol-forte/`,
        },
      ],
    };
  }

  remove(id: number) {
    return {
      meds: [
        {
          title: 'Trimol',
          category: "Og'riq qoldiruvchi",
          code: 5440005,
          description: `Парацетамол меъда-ичак йўлларидан тез ва деярли тўлиқ сўрилади. Плазмадаги чўққи концентрациясига 30-60 минутда эришади ва плазмадан ярим чиқарилиш даври терапевтик дозадан кейин 1-4 соатни ташкил қилади. Парацетамол аъзолар ва суюқликларида нисбатан тенг тақсимланади. Дори воситанинг плазма протеинлари билан боғланиши ўзгарувчан: ўткир интоксикация вақтида учрайдиган концентрацияларда 20-50% боғланиши мумкин. Терапевтик дозага қараб 90-100% дори восита биринчи кун давомида сийдик билан чиқарилиши мумкин. Шунга қарамасдан парацетамол деярли ўзгармасдан чиқарилмайди, асосий қисми жигардаги конъюгациясидан кейин чиқарилади.

          Ko'proq o'qish https://medu.uz/instruksiya/trimol-forte/`,
        },
      ],
    };
  }
}
